crafted-emacs-early-config.el
;;; crafted-emacs-early-config.el -- Emacs customization file, based on the Crafted config -*- lexical-binding: t; -*-
;; This file is generated from crafted-emacs.org. If you want to edit the
;; configuration, DO NOT edit crafted-emacs-early-config.el, edit crafted-emacs.org, instead.

(defvar dotfiles-path
  (expand-file-name "Projects/dotfiles" (getenv "HOME"))
  "My dotfiles path")
